### YamlMime:AzureCLIGroup
uid: az_sentinel_bookmark
name: az sentinel bookmark
extensionInformation: >-
  > [!Note]

  > Dieser Verweis ist Teil der **Sentinel** -Erweiterung für Azure CLI und erfordert Version 2.11.0 oder höher.  Die Erweiterung wird automatisch installiert, wenn Sie den Befehl **AZ Sentinel Bookmark** zum ersten Mal ausführen.  [Weitere Informationen zu Erweiterungen](https://docs.microsoft.com/en-us/cli/azure/azure-cli-extensions-overview)
summary: Sentinel-Lesezeichen.
description: ''
directCommands:
- uid: az_sentinel_bookmark_create
  name: az sentinel bookmark create
  summary: Erstellen Sie das Lesezeichen.
  description: ''
  syntax: >-
    az sentinel bookmark create --bookmark-id
                                --resource-group
                                --workspace-name
                                [--created]
                                [--display-name]
                                [--etag]
                                [--incident-info]
                                [--labels]
                                [--notes]
                                [--query-result]
                                [--updated]
                                [--updated-by-object-id]
                                [-q]
  examples:
  - summary: Erstellt oder aktualisiert ein Lesezeichen.
    syntax: az sentinel bookmark create --etag "{etag}" --created "2019-01-01T13:15:30Z" --display-name "My bookmark" --labels "Tag1" --labels "Tag2" --notes "Found a suspicious activity" -q "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)" --query-result "Security Event query result" --updated "2019-01-01T13:15:30Z" --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: Lesezeichen-ID.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Den Namen des Arbeitsbereichs
    description: ''
  optionalParameters:
  - name: --created
    summary: Der Zeitpunkt, zu dem das Lesezeichen erstellt wurde.
    description: ''
  - name: --display-name
    summary: Der Anzeige Name des Lesezeichens.
    description: ''
  - name: --etag
    summary: ETag der Azure-Ressource.
    description: ''
  - name: --incident-info
    summary: Beschreibt einen Incident, der sich auf das Lesezeichen bezieht.
    description: >-
      Syntax:--Incident-Info Incident-ID = XX Schweregrad = XX Title = XX Relation-Name = XX


      Incident-ID: erforderlich. Schweregrad der Incident-ID: erforderlich. Der Schweregrad des incidenttitels: erforderlich. Der Titel der incidentbeziehung-Name: erforderlich. Beziehungs Name.
  - name: --labels
    summary: Liste der für dieses Lesezeichen relevanten Bezeichnungen.
    description: ''
  - name: --notes
    summary: Die Notizen des Lesezeichens.
    description: ''
  - name: --query-result
    summary: Das Abfrageergebnis des Lesezeichens.
    description: ''
  - name: --updated
    summary: Der Zeitpunkt der letzten Aktualisierung des Lesezeichens.
    description: ''
  - name: --updated-by-object-id
    summary: Die Objekt-ID des Benutzers.
    description: ''
  - name: -q
    summary: Die Abfrage des Lesezeichens.
    description: ''
- uid: az_sentinel_bookmark_delete
  name: az sentinel bookmark delete
  summary: Löschen Sie das Lesezeichen.
  description: ''
  syntax: >-
    az sentinel bookmark delete --bookmark-id
                                --resource-group
                                --workspace-name
                                [--yes]
  examples:
  - summary: Löschen eines Lesezeichens.
    syntax: az sentinel bookmark delete --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: Lesezeichen-ID.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Den Namen des Arbeitsbereichs
    description: ''
  optionalParameters:
  - name: --yes -y
    summary: Nicht zur Bestätigung auffordern
    description: ''
- uid: az_sentinel_bookmark_list
  name: az sentinel bookmark list
  summary: Ruft alle Lesezeichen ab.
  description: ''
  syntax: >-
    az sentinel bookmark list --resource-group
                              --workspace-name
  examples:
  - summary: Alle Lesezeichen erhalten.
    syntax: az sentinel bookmark list --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Den Namen des Arbeitsbereichs
    description: ''
- uid: az_sentinel_bookmark_show
  name: az sentinel bookmark show
  summary: Ruft ein Lesezeichen ab.
  description: ''
  syntax: >-
    az sentinel bookmark show --bookmark-id
                              --resource-group
                              --workspace-name
  examples:
  - summary: Ein Lesezeichen erhalten.
    syntax: az sentinel bookmark show --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: Lesezeichen-ID.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Den Namen des Arbeitsbereichs
    description: ''
- uid: az_sentinel_bookmark_update
  name: az sentinel bookmark update
  summary: Aktualisieren Sie das Lesezeichen.
  description: ''
  syntax: >-
    az sentinel bookmark update --bookmark-id
                                --resource-group
                                --workspace-name
                                [--created]
                                [--display-name]
                                [--etag]
                                [--incident-info]
                                [--labels]
                                [--notes]
                                [--query-result]
                                [--updated]
                                [--updated-by-object-id]
                                [-q]
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: Lesezeichen-ID.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Den Namen des Arbeitsbereichs
    description: ''
  optionalParameters:
  - name: --created
    summary: Der Zeitpunkt, zu dem das Lesezeichen erstellt wurde.
    description: ''
  - name: --display-name
    summary: Der Anzeige Name des Lesezeichens.
    description: ''
  - name: --etag
    summary: ETag der Azure-Ressource.
    description: ''
  - name: --incident-info
    summary: Beschreibt einen Incident, der sich auf das Lesezeichen bezieht.
    description: >-
      Syntax:--Incident-Info Incident-ID = XX Schweregrad = XX Title = XX Relation-Name = XX


      Incident-ID: erforderlich. Schweregrad der Incident-ID: erforderlich. Der Schweregrad des incidenttitels: erforderlich. Der Titel der incidentbeziehung-Name: erforderlich. Beziehungs Name.
  - name: --labels
    summary: Liste der für dieses Lesezeichen relevanten Bezeichnungen.
    description: ''
  - name: --notes
    summary: Die Notizen des Lesezeichens.
    description: ''
  - name: --query-result
    summary: Das Abfrageergebnis des Lesezeichens.
    description: ''
  - name: --updated
    summary: Der Zeitpunkt der letzten Aktualisierung des Lesezeichens.
    description: ''
  - name: --updated-by-object-id
    summary: Die Objekt-ID des Benutzers.
    description: ''
  - name: -q
    summary: Die Abfrage des Lesezeichens.
    description: ''
commands:
- az_sentinel_bookmark_create
- az_sentinel_bookmark_delete
- az_sentinel_bookmark_list
- az_sentinel_bookmark_show
- az_sentinel_bookmark_update
globalParameters:
- name: --debug
  summary: Ausführlichkeit der Protokollierung erhöhen, um alle Debugprotokolle anzuzeigen.
- name: --help -h
  summary: Zeigen Sie diese Hilfemeldung an, und schließen Sie sie.
- name: --only-show-errors
  summary: Nur Fehler anzeigen und Warnungen unterdrücken.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Ausgabeformat.
- name: --query
  summary: JMESPath-Abfragezeichenfolge. Weitere Informationen und Beispiele finden Sie unter <a href="http://jmespath.org/">http://jmespath.org/</a>.
- name: --verbose
  summary: Ausführlichkeit der Protokollierung erhöhen. „--debug“ für vollständige Debugprotokolle verwenden.
metadata:
  description: Sentinel-Lesezeichen.
  ms.openlocfilehash: c6825b3b0fd8c45758090ea3bb6e03229a33f427
  ms.sourcegitcommit: 612554c029ba1f28d3a43fd22e743104a1a30ea0
  ms.translationtype: MT
  ms.contentlocale: de-DE
  ms.lasthandoff: 04/07/2021
  ms.locfileid: "106932638"
