### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics
name: az monitor log-analytics
summary: Verwalten von Azure Log Analytics.
description: ''
directCommands:
- uid: az_monitor_log-analytics_query
  name: az monitor log-analytics query
  summary: Fragen Sie einen Log Analytics-Arbeitsbereich ab.
  description: ''
  syntax: >-
    az monitor log-analytics query --analytics-query
                                   --workspace
                                   [--timespan]
                                   [--workspaces]
  examples:
  - summary: Führen Sie in den letzten 3,5 Tagen eine einfache Abfrage aus.
    syntax: az monitor log-analytics query -w workspace-customId --analytics-query "AzureActivity | summarize count() by bin(timestamp, 1h)" -t P3DT12H
  - summary: Ausführen einer gespeicherten Abfrage im Arbeitsbereich
    syntax: >-
      QUERY=$(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)

      az monitor log-analytics query -w workspace-customId --analytics-query "$QUERY"
  requiredParameters:
  - isRequired: true
    name: --analytics-query
    summary: Abfrage, die über Log Analytics-Daten ausgeführt werden soll.
    description: ''
  - isRequired: true
    name: --workspace -w
    summary: GUID des Log Analytics-Arbeitsbereichs.
    description: ''
  optionalParameters:
  - name: --timespan -t
    summary: Zeitraum, über den die Abfrage ausgeführt werden soll. Standardmäßig werden alle verfügbaren Daten abfragt.
    description: ''
  - name: --workspaces
    summary: Zusätzliche Arbeitsbereiche zur Vereinigung von Daten für Abfragen. Geben Sie zusätzliche Arbeitsbereichs-IDs an, die durch Leerzeichen getrennt sind.
    description: ''
commands:
- az_monitor_log-analytics_cluster
- az_monitor_log-analytics_cluster_create
- az_monitor_log-analytics_cluster_delete
- az_monitor_log-analytics_cluster_list
- az_monitor_log-analytics_cluster_show
- az_monitor_log-analytics_cluster_update
- az_monitor_log-analytics_cluster_wait
- az_monitor_log-analytics_workspace
- az_monitor_log-analytics_workspace_create
- az_monitor_log-analytics_workspace_data-export
- az_monitor_log-analytics_workspace_data-export_create
- az_monitor_log-analytics_workspace_data-export_delete
- az_monitor_log-analytics_workspace_data-export_list
- az_monitor_log-analytics_workspace_data-export_show
- az_monitor_log-analytics_workspace_data-export_update
- az_monitor_log-analytics_workspace_delete
- az_monitor_log-analytics_workspace_get-schema
- az_monitor_log-analytics_workspace_get-shared-keys
- az_monitor_log-analytics_workspace_linked-service
- az_monitor_log-analytics_workspace_linked-service_create
- az_monitor_log-analytics_workspace_linked-service_delete
- az_monitor_log-analytics_workspace_linked-service_list
- az_monitor_log-analytics_workspace_linked-service_show
- az_monitor_log-analytics_workspace_linked-service_update
- az_monitor_log-analytics_workspace_linked-service_wait
- az_monitor_log-analytics_workspace_linked-storage
- az_monitor_log-analytics_workspace_linked-storage_add
- az_monitor_log-analytics_workspace_linked-storage_create
- az_monitor_log-analytics_workspace_linked-storage_delete
- az_monitor_log-analytics_workspace_linked-storage_list
- az_monitor_log-analytics_workspace_linked-storage_remove
- az_monitor_log-analytics_workspace_linked-storage_show
- az_monitor_log-analytics_workspace_list
- az_monitor_log-analytics_workspace_list-deleted-workspaces
- az_monitor_log-analytics_workspace_list-management-groups
- az_monitor_log-analytics_workspace_list-usages
- az_monitor_log-analytics_workspace_pack
- az_monitor_log-analytics_workspace_pack_disable
- az_monitor_log-analytics_workspace_pack_enable
- az_monitor_log-analytics_workspace_pack_list
- az_monitor_log-analytics_workspace_recover
- az_monitor_log-analytics_workspace_saved-search
- az_monitor_log-analytics_workspace_saved-search_create
- az_monitor_log-analytics_workspace_saved-search_delete
- az_monitor_log-analytics_workspace_saved-search_list
- az_monitor_log-analytics_workspace_saved-search_show
- az_monitor_log-analytics_workspace_saved-search_update
- az_monitor_log-analytics_workspace_show
- az_monitor_log-analytics_workspace_table
- az_monitor_log-analytics_workspace_table_list
- az_monitor_log-analytics_workspace_table_show
- az_monitor_log-analytics_workspace_table_update
- az_monitor_log-analytics_workspace_update
- az_monitor_log-analytics_query
- az_monitor_log-analytics_solution
- az_monitor_log-analytics_solution_create
- az_monitor_log-analytics_solution_delete
- az_monitor_log-analytics_solution_list
- az_monitor_log-analytics_solution_show
- az_monitor_log-analytics_solution_update
globalParameters:
- name: --debug
  summary: Ausführlichkeit der Protokollierung erhöhen, um alle Debugprotokolle anzuzeigen.
- name: --help -h
  summary: Zeigen Sie diese Hilfemeldung an, und schließen Sie sie.
- name: --only-show-errors
  summary: Nur Fehler anzeigen und Warnungen unterdrücken.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Ausgabeformat.
- name: --query
  summary: JMESPath-Abfragezeichenfolge. Weitere Informationen und Beispiele finden Sie unter <a href="http://jmespath.org/">http://jmespath.org/</a>.
- name: --verbose
  summary: Ausführlichkeit der Protokollierung erhöhen. „--debug“ für vollständige Debugprotokolle verwenden.
metadata:
  doc_source_url_repo: https://github.com/Azure/azure-cli/blob/dev/
  ms.date: 04/13/2021
  description: Verwalten von Azure Log Analytics.
  ms.openlocfilehash: 3a8ff95ccc8161070fbeb7a74e37a759a2348dae
  ms.sourcegitcommit: d01260d847ea835a8bbab0e0db73d1b39f5c18ef
  ms.translationtype: MT
  ms.contentlocale: de-DE
  ms.lasthandoff: 04/13/2021
  ms.locfileid: "107347276"
