### YamlMime:AzureCLIGroup
uid: ext_log-analytics_az_monitor_log_analytics
name: az monitor log-analytics
extensionInformation: >-
  > [!Note]

  > Diese Referenz ist Teil der **Log Analytics-** Erweiterung für Azure CLI und erfordert Version 2.0.0 oder höher.  Die Erweiterung wird automatisch installiert, wenn Sie den Befehl **AZ Monitor Log-Analytics** zum ersten Mal ausführen.  [Weitere Informationen zu Erweiterungen](https://docs.microsoft.com/en-us/cli/azure/azure-cli-extensions-overview)
summary: Befehle zum Abfragen von Daten in Log Analytics-Arbeitsbereichen.
description: ''
directCommands:
- uid: ext_log-analytics_az_monitor_log_analytics_query
  name: az monitor log-analytics query
  summary: Fragen Sie einen Log Analytics Arbeitsbereich ab.
  description: ''
  syntax: >-
    az monitor log-analytics query --analytics-query
                                   --workspace
                                   [--timespan]
                                   [--workspaces]
  examples:
  - summary: Führen Sie eine einfache Abfrage über die letzten 3,5 Tage aus.
    syntax: az monitor log-analytics query -w workspace-customId --analytics-query "AzureActivity | summarize count() by bin(timestamp, 1h)" -t P3DT12H
  - summary: Ausführen einer gespeicherten Abfrage im Arbeitsbereich
    syntax: >-
      QUERY=$(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)

      az monitor log-analytics query -w workspace-customId --analytics-query "$QUERY"
  requiredParameters:
  - isRequired: true
    name: --analytics-query
    summary: Die Abfrage, die über Log Analytics Daten ausgeführt werden soll.
    description: ''
  - isRequired: true
    name: --workspace -w
    summary: GUID des Log Analytics Arbeitsbereichs.
    description: ''
  optionalParameters:
  - name: --timespan -t
    summary: Zeitspanne, über die abgefragt werden soll. Standardmäßig werden alle verfügbaren Daten abgefragt.
    description: ''
  - name: --workspaces
    summary: Zusätzliche Arbeitsbereiche für Union-Daten für Abfragen. Geben Sie zusätzliche Arbeitsbereichs-IDs getrennt durch Leerzeichen an
    description: ''
commands:
- ext_log-analytics_az_monitor_log_analytics_query
globalParameters:
- name: --debug
  summary: Ausführlichkeit der Protokollierung erhöhen, um alle Debugprotokolle anzuzeigen.
- name: --help -h
  summary: Zeigen Sie diese Hilfemeldung an, und schließen Sie sie.
- name: --only-show-errors
  summary: Nur Fehler anzeigen und Warnungen unterdrücken.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Ausgabeformat.
- name: --query
  summary: JMESPath-Abfragezeichenfolge. Weitere Informationen und Beispiele finden Sie unter <a href="http://jmespath.org/">http://jmespath.org/</a>.
- name: --verbose
  summary: Ausführlichkeit der Protokollierung erhöhen. „--debug“ für vollständige Debugprotokolle verwenden.
metadata:
  description: Befehle zum Abfragen von Daten in Log Analytics-Arbeitsbereichen.
  ms.openlocfilehash: 5b96adf598bf72e955ea1fae9d2662258ecdc62c
  ms.sourcegitcommit: 2a0ae2ffc14ce325f9adb9c09d6b5eac534df8a6
  ms.translationtype: MT
  ms.contentlocale: de-DE
  ms.lasthandoff: 01/27/2021
  ms.locfileid: "102903189"
