### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics_workspace_saved-search
name: az monitor log-analytics workspace saved-search
summary: Gespeicherte Suche für Log Analytics-Arbeitsbereich verwalten.
description: ''
directCommands:
- uid: az_monitor_log-analytics_workspace_saved-search_create
  name: az monitor log-analytics workspace saved-search create
  summary: Erstellen Sie eine gespeicherte Suche für einen bestimmten Arbeitsbereich.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search create --category
                                                           --display-name
                                                           --name
                                                           --resource-group
                                                           --saved-query
                                                           --workspace-name
                                                           [--fa]
                                                           [--fp]
                                                           [--subscription]
                                                           [--tags]
  examples:
  - summary: Erstellen Sie eine gespeicherte Suche für einen bestimmten Arbeitsbereich.
    syntax: az monitor log-analytics workspace saved-search create -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(TimeGenerated, 1h)" --fa myfun --fp "a:string = value"
  requiredParameters:
  - isRequired: true
    name: --category
    summary: Die Kategorie der gespeicherten Suche. Dies hilft dem Benutzer, eine gespeicherte Suche schneller zu finden.
    description: ''
  - isRequired: true
    name: --display-name
    summary: Anzeige Name der gespeicherten Suche.
    description: ''
  - isRequired: true
    name: --name -n
    summary: Der Name der gespeicherten Suche, der in einem bestimmten Arbeitsbereich eindeutig ist.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --saved-query -q
    summary: Der Abfrage Ausdruck für die gespeicherte Suche.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Der Name des Log Analytics Arbeitsbereichs.
    description: ''
  optionalParameters:
  - name: --fa --func-alias
    summary: Funktions Aliase sind Kurznamen für gespeicherte Suchvorgänge, damit Sie in der Abfrage problemlos referenziert werden können. Sie sind für Computer Gruppen erforderlich.
    description: ''
  - name: --fp --func-param
    summary: "Die optionalen Funktionsparameter, wenn die Abfrage als Funktion fungiert. Der Wert sollte das folgende Format aufweisen: ' param-Name1: Typ1 = default_value1, param-Name2: Typ2 = default_value2 '. Weitere Beispiele und die richtige Syntax finden Sie unter https://docs.microsoft.com/en-us/azure/kusto/query/functions/user-defined-functions ."
    description: ''
  - name: --subscription
    summary: Der Name oder die ID des Abonnements. Sie können das Standard Abonnement mit konfigurieren `az account set -s NAME_OR_ID` .
    description: ''
  - name: --tags
    summary: 'Durch Leerzeichen getrennte Tags: Key [= value] [key [= value]...]. Verwenden Sie "", um vorhandene Tags zu löschen.'
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_delete
  name: az monitor log-analytics workspace saved-search delete
  summary: Löscht eine gespeicherte Suche für einen angegebenen Arbeitsbereich.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search delete --name
                                                           --resource-group
                                                           --workspace-name
                                                           [--subscription]
                                                           [--yes]
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Der Name der gespeicherten Suche, der in einem bestimmten Arbeitsbereich eindeutig ist.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Der Name des Log Analytics Arbeitsbereichs.
    description: ''
  optionalParameters:
  - name: --subscription
    summary: Der Name oder die ID des Abonnements. Sie können das Standard Abonnement mit konfigurieren `az account set -s NAME_OR_ID` .
    description: ''
  - name: --yes -y
    summary: Nicht zur Bestätigung auffordern
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_list
  name: az monitor log-analytics workspace saved-search list
  summary: Listet alle gespeicherten Suchvorgänge für einen bestimmten Arbeitsbereich auf.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search list --resource-group
                                                         --workspace-name
                                                         [--query-examples]
                                                         [--subscription]
  requiredParameters:
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Der Name des Log Analytics Arbeitsbereichs.
    description: ''
  optionalParameters:
  - name: --query-examples
    summary: Empfehlen Sie die jmespath-Zeichenfolge für Sie. Sie können eine der Abfragen kopieren und Sie nach dem Abfrage Parameter in doppelte Anführungszeichen einfügen, um die Ergebnisse anzuzeigen. Sie können ein oder mehrere Positions Schlüsselwörter hinzufügen, um Vorschläge auf der Grundlage dieser Schlüsselwörter zu geben.
    description: ''
  - name: --subscription
    summary: Der Name oder die ID des Abonnements. Sie können das Standard Abonnement mit konfigurieren `az account set -s NAME_OR_ID` .
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_show
  name: az monitor log-analytics workspace saved-search show
  summary: Hiermit wird eine gespeicherte Suche für einen bestimmten Arbeitsbereich angezeigt.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search show --name
                                                         --resource-group
                                                         --workspace-name
                                                         [--query-examples]
                                                         [--subscription]
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Der Name der gespeicherten Suche, der in einem bestimmten Arbeitsbereich eindeutig ist.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Der Name des Log Analytics Arbeitsbereichs.
    description: ''
  optionalParameters:
  - name: --query-examples
    summary: Empfehlen Sie die jmespath-Zeichenfolge für Sie. Sie können eine der Abfragen kopieren und Sie nach dem Abfrage Parameter in doppelte Anführungszeichen einfügen, um die Ergebnisse anzuzeigen. Sie können ein oder mehrere Positions Schlüsselwörter hinzufügen, um Vorschläge auf der Grundlage dieser Schlüsselwörter zu geben.
    description: ''
  - name: --subscription
    summary: Der Name oder die ID des Abonnements. Sie können das Standard Abonnement mit konfigurieren `az account set -s NAME_OR_ID` .
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_update
  name: az monitor log-analytics workspace saved-search update
  summary: Aktualisiert eine gespeicherte Suche für einen bestimmten Arbeitsbereich.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search update --name
                                                           --resource-group
                                                           --workspace-name
                                                           [--add]
                                                           [--category]
                                                           [--display-name]
                                                           [--fa]
                                                           [--force-string]
                                                           [--fp]
                                                           [--remove]
                                                           [--saved-query]
                                                           [--set]
                                                           [--subscription]
                                                           [--tags]
  examples:
  - summary: Aktualisiert eine gespeicherte Suche für einen bestimmten Arbeitsbereich.
    syntax: az monitor log-analytics workspace saved-search update -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(TimeGenerated, 1h)" --fa myfun --fp "a:string = value"
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Der Name der gespeicherten Suche, der in einem bestimmten Arbeitsbereich eindeutig ist.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Name der Ressourcengruppe Sie können die Standardgruppe mit `az configure --defaults group=<name>` konfigurieren.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Der Name des Log Analytics Arbeitsbereichs.
    description: ''
  optionalParameters:
  - name: --add
    summary: Fügen Sie einer Liste von-Objekten ein Objekt hinzu, indem Sie ein Pfad-und Schlüssel-Wert-Paar angeben.  Beispiel:--Add Property. ListProperty <Key = Value, String oder JSON String>.
    description: ''
  - name: --category
    summary: Die Kategorie der gespeicherten Suche. Dies hilft dem Benutzer, eine gespeicherte Suche schneller zu finden.
    description: ''
  - name: --display-name
    summary: Anzeige Name der gespeicherten Suche.
    description: ''
  - name: --fa --func-alias
    summary: Funktions Aliase sind Kurznamen für gespeicherte Suchvorgänge, damit Sie in der Abfrage problemlos referenziert werden können. Sie sind für Computer Gruppen erforderlich.
    description: ''
  - name: --force-string
    summary: Wenn Sie "Set" oder "Add" verwenden, erhalten Sie Zeichen folgen Literale, anstatt zu versuchen, in JSON zu konvertieren.
    description: ''
  - name: --fp --func-param
    summary: "Die optionalen Funktionsparameter, wenn die Abfrage als Funktion fungiert. Der Wert sollte das folgende Format aufweisen: ' param-Name1: Typ1 = default_value1, param-Name2: Typ2 = default_value2 '. Weitere Beispiele und die richtige Syntax finden Sie unter https://docs.microsoft.com/en-us/azure/kusto/query/functions/user-defined-functions ."
    description: ''
  - name: --remove
    summary: Entfernt eine Eigenschaft oder ein Element aus einer Liste.  Beispiel:--Remove Property. List <indexToRemove> oder--Remove propertytoremove.
    description: ''
  - name: --saved-query -q
    summary: Der Abfrage Ausdruck für die gespeicherte Suche.
    description: ''
  - name: --set
    summary: Aktualisieren Sie ein Objekt, indem Sie einen Eigenschafts Pfad und einen festzulegenden Wert angeben.  Beispiel:--Set Eigenschaft1. Eigenschaft2 =<value>.
    description: ''
  - name: --subscription
    summary: Der Name oder die ID des Abonnements. Sie können das Standard Abonnement mit konfigurieren `az account set -s NAME_OR_ID` .
    description: ''
  - name: --tags
    summary: 'Durch Leerzeichen getrennte Tags: Key [= value] [key [= value]...]. Verwenden Sie "", um vorhandene Tags zu löschen.'
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
commands:
- az_monitor_log-analytics_workspace_saved-search_create
- az_monitor_log-analytics_workspace_saved-search_delete
- az_monitor_log-analytics_workspace_saved-search_list
- az_monitor_log-analytics_workspace_saved-search_show
- az_monitor_log-analytics_workspace_saved-search_update
globalParameters:
- name: --debug
  summary: Ausführlichkeit der Protokollierung erhöhen, um alle Debugprotokolle anzuzeigen.
- name: --help -h
  summary: Zeigen Sie diese Hilfemeldung an, und schließen Sie sie.
- name: --only-show-errors
  summary: Nur Fehler anzeigen und Warnungen unterdrücken.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Ausgabeformat.
- name: --query
  summary: JMESPath-Abfragezeichenfolge. Weitere Informationen und Beispiele finden Sie unter <a href="http://jmespath.org/">http://jmespath.org/</a>.
- name: --verbose
  summary: Ausführlichkeit der Protokollierung erhöhen. „--debug“ für vollständige Debugprotokolle verwenden.
metadata:
  doc_source_url_repo: https://github.com/Azure/azure-cli/blob/dev/
  ms.date: 02/23/2021
  description: Gespeicherte Suche für Log Analytics-Arbeitsbereich verwalten.
  ms.openlocfilehash: f4e49668c49ccd92d8e596e035510ea381c9151f
  ms.sourcegitcommit: 612554c029ba1f28d3a43fd22e743104a1a30ea0
  ms.translationtype: MT
  ms.contentlocale: de-DE
  ms.lasthandoff: 04/07/2021
  ms.locfileid: "106841625"
